# Data wrangling with Pandas exercise
* For this exercise we will be using the `listings.csv` data file.

In [1]:
import pandas as pd
import numpy as np

# Load in the data file using `pd.read_csv()`

In [2]:
# Load data here

df = pd.read_csv('data/listings.csv')
df

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,175,3,48,2019-11-04,0.37,2,365
1,3831,"Whole flr w/private bdrm, bath & kitchen(pls r...",4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,75,1,340,2020-08-01,4.75,1,265
2,5121,BlissArtsSpace!,7356,Garon,Brooklyn,Bedford-Stuyvesant,40.68688,-73.95596,Private room,60,29,50,2019-12-02,0.37,1,365
3,5136,"Spacious Brooklyn Duplex, Patio + Garden",7378,Rebecca,Brooklyn,Sunset Park,40.66120,-73.99423,Entire home/apt,175,14,1,2014-01-02,0.01,1,295
4,5178,Large Furnished Room Near B'way,8967,Shunichi,Manhattan,Hell's Kitchen,40.76489,-73.98493,Private room,65,2,473,2020-03-15,3.44,1,340
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
46522,44807522,Designer Gramercy Studio Townhouse by UNSQ,12941925,Brian,Manhattan,Gramercy,40.73433,-73.98383,Entire home/apt,145,7,0,NaN,NaN,1,164
46523,44807786,Cozy & comfy apt in the heart of Inwood Manhattan,284790520,Salar,Manhattan,Washington Heights,40.85820,-73.92733,Entire home/apt,87,6,0,NaN,NaN,2,85
46524,44811717,Comfortable safe environment 24hr security camera,362453686,Nicole,Brooklyn,East Flatbush,40.65399,-73.93287,Private room,59,3,0,NaN,NaN,1,90
46525,44814944,Upper West Side studio 86th Street,4039777,Fernando,Manhattan,Upper West Side,40.78731,-73.97029,Entire home/apt,80,30,0,NaN,NaN,1,113
46526,44818009,"5MIN D/N trains, NEAR THE BEACH, 50’ TO MANHATTAN",48098268,Marina,Brooklyn,Gravesend,40.59945,-73.98209,Private room,66,1,0,NaN,NaN,1,38

## Exercise 2 - Filtering

Return the following subsets of the dataframe.

1. How many listings are there with a price less than 100? 


2. Find how many listings there are in just Brooklyn.


3. Find how many listings there are in Brooklyn with a price less than 100.


4. Using `.isin()` select anyone that has the host name of Michael, David, John, and Daniel.


5. Create a new column called `adjusted_price` that has $100 added to every listing in Williamsburg.  The prices for all other listings should be the same as the were before. 


6. What % of the rooms are private, and what % of the rooms are shared.  
    * Hint, use `.value_counts()`

In [3]:
# 1. How many listings are there with a price less than 100? 

df_under100 = df[df.price < 100]
len(df_under100)

22778

In [4]:
# 2. Make a new DataFrame of listings in Brooklyn named `df_bk` 
# and find how many listings in just Brooklyn.

df_bk = df[df.neighbourhood_group == 'Brooklyn'] # Arrrrgh! They used the Britisn spelling here.
len(df_bk)

18632

In [5]:
# 3. Find how many listings there are in Brooklyn with a price less than 100.

df_bk_under100 = df_bk[df_bk.price < 100]
len(df_bk_under100)

10473

In [6]:
# 4. Using `.isin()` select anyone that has the host name of Michael, David, John, and Daniel.

df_specifichosts = df[df.host_name.isin(['Michael', 'David', 'John', 'Daniel'])]
df_specifichosts

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
52,16595,LOFT HAVEN ~ Six Windows ~ Bricks ~ Plants ~ Q...,64522,Daniel,Brooklyn,Williamsburg,40.70933,-73.96792,Entire home/apt,271,1,172,2020-07-14,1.44,1,365
201,61747,"Cozy, Brooklyn, Prospect Park Studio",299370,David,Brooklyn,Prospect-Lefferts Gardens,40.65979,-73.96180,Entire home/apt,91,14,97,2018-01-31,0.83,1,44
209,62903,Beautiful modern studio apartment in heart of NYC,306605,Daniel,Manhattan,Chelsea,40.74238,-73.99567,Entire home/apt,205,15,68,2019-12-14,0.67,2,89
220,64015,Prime East Village 1 Bedroom,146944,David,Manhattan,East Village,40.72807,-73.98594,Entire home/apt,200,3,0,NaN,NaN,1,0
260,74073,Food & Music Dream Apartment in Williamsburg,211877,Daniel,Brooklyn,Williamsburg,40.71113,-73.96054,Entire home/apt,187,30,90,2020-07-31,0.81,1,261
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
46362,44639591,Central & Stylish 1 Bedroom Apt - Heart of Che...,286136716,John,Manhattan,Chelsea,40.74568,-73.99694,Entire home/apt,110,30,0,NaN,NaN,3,110
46396,44661297,Flushing Sunshine home #101,361579037,Daniel,Queens,Flushing,40.74603,-73.82837,Private room,52,1,0,NaN,NaN,2,360
46403,44662157,Flushing Sunshine home #102,361579037,Daniel,Queens,Flushing,40.74441,-73.82829,Private room,55,1,3,2020-08-16,3.00,2,365
46455,44697211,David’s Queen Sized Room,343477029,David,Queens,Far Rockaway,40.59460,-73.75875,Private room,95,1,0,NaN,NaN,1,365
46508,44797527,Long-Term: Furnished Apt in Nolita w/ Amenities,19448640,David,Manhattan,Nolita,40.72289,-73.99400,Entire home/apt,140,30,0,NaN,NaN,1,282

In [7]:
# 5. Create a new column called `adjusted_price` that has $100 added to every listing in Williamsburg.  
# The prices for all other listings should be the same as the were before. 

def illustrate_adjusted_price(): # Select a small subset of data to illustrate the adjusted price.
    df_neighborhood_prices = df[['id', 'neighbourhood', 'price', 'adjusted_price']]
    df_by_neighborhood = df_neighborhood_prices.groupby('neighbourhood') \
                                               .first() \
                                               .reset_index()
    williamsburg_index = np.where(df_by_neighborhood.neighbourhood == 'Williamsburg')[0][0]
    select_slice = slice(max(williamsburg_index - 5, 0), # 5 rows before the Williamsburg row
                         min(williamsburg_index + 6, len(df_by_neighborhood))) # 5 rows after the Williamsburg row
    return df_by_neighborhood.iloc[select_slice] \
                             .style.format({'price': '${:,}'.format, 'adjusted_price': '${:,}'.format})

df['adjusted_price'] = np.where(df.neighbourhood == 'Williamsburg', df.price + 100, df.price)
illustrate_adjusted_price()

In [8]:
# 6. What % of the rooms are private, and what % of the rooms are shared.  

room_type_stats = df.room_type.value_counts(normalize=True)
print(room_type_stats.to_string(float_format='{:.2%}'.format))

Entire home/apt   51.58%
Private room      45.44%
Shared room        2.12%
Hotel room         0.86%

# Exercise 3 - Grouping

1. Using `groupby`, count how many listings are in each neighbourhood_group.


2. Using `groupby`, find the mean price for each of the neighbourhood_groups. 


3. Using `groupby` and `.agg()`, find the min and max price for each of the neighbourhood_groups. 


4. Using `groupby`, find the median price for each room type in each neighbourhood_group.


5. Using `groupby` and `.agg()`, find the count, min, max, mean, median, and std of the prices for each room type in each neighbourhood_group.

In [9]:
# 1. Using `groupby`, count how many listings are in each neighbourhood_group.

df_byneighbourhoods = df.groupby(by='neighbourhood_group')
df_byneighbourhoods.id \
                   .agg(['count']) \
                   .style.format({'count': '{:,}'.format})

In [10]:
# 2. Using `groupby`, find the mean price for each of the neighbourhood_groups. 

mean_neighbourhood_prices = df_byneighbourhoods.price.mean()
print(mean_neighbourhood_prices.to_string(float_format='${:,.2f}'.format))

neighbourhood_group
Bronx            $92.75
Brooklyn        $120.23
Manhattan       $191.88
Queens           $99.75
Staten Island   $110.95

In [11]:
# 3. Using `groupby` and `.agg()`, find the min and max price for each of the neighbourhood_groups. 

df_byneighbourhoods.price \
                   .agg(['min', 'max']) \
                   .style.format({'min': '${:,}'.format,
                                  'max': '${:,}'.format})

In [12]:
# 4. Using `groupby`, find the mean price for each room type in each neighbourhood_group.

df_byneighbourhood_byroom = df.groupby(by=['neighbourhood_group', 'room_type'])
df_byneighbourhood_byroom.price \
                         .agg(['mean']) \
                         .style.format({'mean': '${:,.2f}'.format})

In [13]:
# 5. Using `groupby` and `.agg()`, find the count, min, max, mean, median, and std of the prices 
# for each room type in each neighbourhood_group.

df_byneighbourhood_byroom.price \
                         .agg(['count', 'min', 'max', 'mean', 'median', 'std']) \
                         .style.format({'count': '{:,}'.format,
                                        'min': '${:,.2f}'.format,
                                        'max': '${:,.2f}'.format,
                                        'mean': '${:,.2f}'.format,
                                        'median': '${:,.2f}'.format,
                                        'std': '{:,.2f}'.format})

# Join and file saving.
1. Load the `prices.csv` and the `n_listings.csv`


2. Do join that keeps all the records for each table.
    * Neighbourhood groups should include ['Bronx', 'Brooklyn', 'Manhattan', 'Queens', 'Staten Island',
       'LongIsland']
       
       
3. Save your joined csv as `joined.csv`


4. Load your saved table and see if it looks the same or different that the DataFrame you used to create it.

In [14]:
# 1. Load the `prices.csv` and the `n_listings.csv`

df_prices = pd.read_csv('data/prices.csv', sep=', ', index_col='neighbourhood_group')
df_listings = pd.read_csv('data/n_listings.csv', sep=';', index_col='neighbourhood_group')
print(f'Loaded {len(df_prices)} rows from prices and {len(df_listings)} rows from listings.')

Loaded 5 rows from prices and 4 rows from listings.

<ipython-input-14-15e368f6a453>:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  df_prices = pd.read_csv('data/prices.csv', sep=', ', index_col='neighbourhood_group')

In [15]:
# 2. Do join that keeps all the records for each table.

df_prices_listings = df_prices.join(other=df_listings, how='outer')
df_prices_listings.style.format({'mean_price': '${:,.2f}'.format,
                                 'n_listings': '{:,.0f}'.format},
                                na_rep='')

In [16]:
# 3. Save your joined csv as joined.csv

df_prices_listings.to_csv('data/joined.csv')
del df_prices_listings

In [17]:
# 4. Load your saved table and see if it looks the same or different that the DataFrame you used to create it.
df_prices_listings = pd.read_csv('data/joined.csv', index_col='neighbourhood_group')
df_prices_listings.style.format({'mean_price': '${:,.2f}'.format,
                                 'n_listings': '{:,.0f}'.format},
                                na_rep='')

# Use the grammys.csv data for the next section of questions.

1. Who was won Album of the Year in 2016?


2. Who won Best Rap Album in 2009?


3. How many awards was Kendrick Lamar nomiated for, and how many did he win...?

In [18]:
#  1. Who was won Album of the Year in 2016?

df = pd.read_csv('data/grammys.csv')
winners_2016_album_of_the_year = df[(df.year == 2016)
                                  & (df.winner == True)
                                  & (df.category == 'Album of the Year')]
winners_2016_album_of_the_year

,year,category,nominee,workers,winner
5505,2016,Album of the Year,1989.,"Taylor Swift (artist/producer), Jack Antonoff ...",True

In [19]:
# 2. Who won Best Rap Album in 2009?

winners_2009_best_rap_album = df[(df.year == 2009)
                               & (df.winner == True)
                               & (df.category == 'Best Rap Album')]
winners_2009_best_rap_album

      year        category         nominee     workers  winner
4396  2009  Best Rap Album  Tha Carter III  Lil' Wayne    True

In [20]:
# 3. How many awards was Kendrick Lamar nomiated for, and how many did he win...?

df_Kendrick_Lamar_nominated = df[(df.nominee == 'Kendrick Lamar')
                               | (df.workers.str.contains('Kendrick Lamar'))]
df_Kendrick_Lamar_won = df_Kendrick_Lamar_nominated[df_Kendrick_Lamar_nominated.winner == True]
nominations = len(df_Kendrick_Lamar_nominated)
wins = len(df_Kendrick_Lamar_won)
print(f'Kendrick Lamar was nominated {nominations} times and won {wins} times.')

Kendrick Lamar was nominated 21 times and won 11 times.